<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Loci Tools for ImageJ jar file. NOTE: Code signature verification not available for this download</string>
	<key>Identifier</key>
	<string>com.github.vmiller.download.locitools</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>loci_tools</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>com.github.gregneagle.autopkg.sharedprocessors/DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>loci_tools.jar is deprecated and no longer offered for download. This recipe is now non-functional. Please remove it from your list of recipes.</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>TRUEPREDICATE</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
