<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Loci Tools for ImageJ and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.vmiller.munki.locitools</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/ImageJ</string>
        <key>NAME</key>
        <string>loci_tools</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Loci Tools for ImageJ</string>
            <key>category</key>
            <string>Image Processing</string>
            <key>developer</key>
            <string>Open Microscopy</string>
            <key>display_name</key>
            <string>Loci Tools for ImageJ</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>update_for</key>
            <array>
                <string>ImageJ</string>
            </array>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.vmiller.download.locitools</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>dmg_root</key>
                <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.jar</string>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>DmgCreator</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>additional_makepkginfo_options</key>
                <array>
                    <key>--item</key>
                    <string>%NAME%.jar</string>
                    <key>--destinationpath</key>
                    <string>/Applications/ImageJ/plugins/loci_tools/</string>
                </array>
                <key>pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%CURRENT_VERSION%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>