<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Loci Tools for ImageJ jar file.</string>
    <key>Identifier</key>
    <string>com.github.vmiller.download.locitools</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>loci_tools</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://downloads.openmicroscopy.org/bio-formats/</string>
                <key>re_pattern</key>
                <string>[0-9]\.[0-9]\.[0-9][^-]</string>
                <key>result_output_var_name</key>
                <string>CURRENT_VERSION</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://downloads.openmicroscopy.org/bio-formats/%CURRENT_VERSION%artifacts/loci_tools.jar</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>