<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest admin installer for Sassafras AllSight/LabSight/KeySight.
</string>
    <key>Identifier</key>
    <string>com.github.vmiller.download.sassafrasadmin</string>
    <key>MinimumVersion</key>
    <string>1.4</string>
    <key>Input</key>
    <dict>
        <key>INSTALLER_TYPE</key>
        <string>admin</string>
        <key>NAME</key>
        <string>AllSight</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.vmiller.download.sassafrasallsight</string>
</dict>
</plist>
