<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Imports the latest client installer for Sassafras into Munki</string>
	<key>Identifier</key>
	<string>com.github.vmiller.munki.sassafrasclient</string>
	<key>Input</key>
	<dict>
		<key>INSTALLER_TYPE</key>
		<string>client</string>
		<key>MUNKI_NAME</key>
		<string>K2Client</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>configuration/K2client</string>
		<key>NAME</key>
		<string>AllSight</string>
		<key>pkg_ids_set_optional_true</key>
		<array/>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>configuration</string>
			<key>description</key>
			<string>Keyserver client software</string>
			<key>developer</key>
			<string>Sassafras</string>
			<key>display_name</key>
			<string>Keyserver Client</string>
			<key>name</key>
			<string>%MUNKI_NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>2.7</string>
	<key>ParentRecipe</key>
	<string>com.github.jazzace.download.sassafrasallsight</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>pkginfo_repo_path == ''</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiOptionalReceiptEditor</string>
		</dict>
	</array>
</dict>
</plist>
