<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and packages the latest macOS gitlab-runner binary</string>
	<key>Identifier</key>
	<string>com.github.vmiller.pkg.gitlab-runner</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>gitlab-runner</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.vmiller.download.gitlab-runner</string>	
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                <key>pkgdirs</key>
                <dict>
                    <key>usr/local/bin</key>
                    <string>0755</string>
                    <key>Library/LaunchAgents</key>
                    <string>0755</string>
                </dict>
            </dict>
        </dict>
        <dict>
        	<key>Processor</key>
        	<string>Copier</string>
        	<key>Arguments</key>
        	<dict>
        		<key>source_path</key>
        		<string>%pathname%</string>
        		<key>destination_path</key>
        		<string>%RECIPE_CACHE_DIR%/pkgroot/usr/local/bin</string>
        	</dict>
        </dict>
        <dict>
        	<key>Processor</key>
        	<string>Copier</string>
        	<key>Arguments</key>
        	<dict>
        		<key>source_path</key>
        		<string>%RECIPE_DIR%/pkg_files/com.gitlab.gitlab-runner.plist</string>
        		<key>destination_path</key>
        		<string>%RECIPE_CACHE_DIR%/pkgroot/Library/LaunchAgents</string>
        	</dict>
        </dict>
        <dict>
        	<key>Processor</key>
        	<string>PkgCreator</string>
        	<key>Arguments</key>
        	<dict>
        		<key>pkg_request</key>
        		<dict>
        			<key>pkgname</key>
        			<string>%NAME%-%ARCH%-%version%</string>
        			<key>version</key>
        			<string>%version%</string>
        			<key>id</key>
        			<string>com.gitlab.pkg.gitlab-runner</string>
        			<key>options</key>
        			<string>purge_ds_store</string>
        			<key>scripts</key>
        			<string>Scripts</string>
        			<key>chown</key>
        			<array>
        				<dict>
        					<key>path</key>
        					<string>usr</string>
        					<key>user</key>
        					<string>root</string>
        					<key>group</key>
        					<string>admin</string>
	       				</dict>
        				<dict>
        					<key>path</key>
        					<string>usr/local</string>
        					<key>user</key>
        					<string>root</string>
        					<key>group</key>
        					<string>admin</string>
	       				</dict>
        				<dict>
        					<key>path</key>
        					<string>usr/local/bin</string>
        					<key>user</key>
        					<string>root</string>
        					<key>group</key>
        					<string>admin</string>
	       				</dict>
            			<dict>
        					<key>path</key>
        					<string>usr/local/bin/gitlab-runner</string>
        					<key>user</key>
        					<string>root</string>
        					<key>group</key>
        					<string>admin</string>
        					<key>mode</key>
        					<string>0755</string>
        				</dict>
            			<dict>
        					<key>path</key>
        					<string>Library</string>
        					<key>user</key>
        					<string>root</string>
        					<key>group</key>
        					<string>admin</string>
        					<key>mode</key>
        					<string>0755</string>
        				</dict>
            			<dict>
        					<key>path</key>
        					<string>Library/LaunchAgents</string>
        					<key>user</key>
        					<string>root</string>
        					<key>group</key>
        					<string>admin</string>
        					<key>mode</key>
        					<string>0755</string>
        				</dict>
            			<dict>
        					<key>path</key>
        					<string>Library/LaunchAgents/com.gitlab.gitlab-runner.plist</string>
        					<key>user</key>
        					<string>root</string>
        					<key>group</key>
        					<string>admin</string>
        					<key>mode</key>
        					<string>0755</string>
        				</dict>        				
					</array>
        		</dict>
        	</dict>
        </dict>

	</array>
</dict>
</plist>
