<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest release of the gitlab-runner macOS binary.
		ARCH should be set to arm64 for apple silicon to amd64 for intel</string>
	<key>Identifier</key>
	<string>com.github.vmiller.download.gitlab-runner</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>gitlab-runner</string>
		<key>ARCH</key>
		<string>arm64</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://gitlab.com/api/v4/projects/250833/releases</string>
				<key>re_pattern</key>
				<string>v\d+.\d+.\d+</string>
				<key>result_output_var_name</key>
				<string>tag_name</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://gitlab.com/api/v4/projects/250833/releases</string>
				<key>re_pattern</key>
				<string>\d+.\d+.\d+</string>
				<key>result_output_var_name</key>
				<string>version</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://s3.amazonaws.com/gitlab-runner-downloads/%tag_name%/binaries/gitlab-runner-darwin-%ARCH%</string>
				<key>filename</key>
				<string>gitlab-runner</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
	</array>
</dict>
</plist>
