<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of VESTA</string>
	<key>Identifier</key>
	<string>com.github.vmiller.download.VESTA</string>
	<key>Input</key>
	<dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.1</string>
	<key>Process</key>
	<array>
 		<dict>
 			<key>Arguments</key>
 			<dict>
 				<key>re_pattern</key>
 				<string>[0-9]+\.[0-9]+\.[0-9]+(?=/)</string>
 				<key>result_output_var_name</key>
 				<string>CURRENT_VERSION</string>
 				<key>url</key>
 				<string>https://jp-minerals.org/vesta/en/download.html</string>
 			</dict>
 			<key>Processor</key>
 			<string>URLTextSearcher</string>
 		</dict>
 		<dict>
 			<key>Arguments</key>
 			<dict>
 				<key>url</key>
 				<string>https://jp-minerals.org/vesta/archives/%CURRENT_VERSION%/VESTA.dmg</string>
 			</dict>
 			<key>Processor</key>
 			<string>URLDownloader</string>
 		</dict>
 		<dict>
 			<key>Arguments</key>
 			<dict>
				<key>input_path</key>
				<string>%pathname%/VESTA/VESTA.app</string>
				<key>requirement</key>
				<string>identifier VESTA and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = Y66LM3WNCW</string>
 			</dict>
 			<key>Processor</key>
 			<string>CodeSignatureVerifier</string>
 		</dict>
 		<dict>
 			<key>Processor</key>
 			<string>EndOfCheckPhase</string>
 		</dict>
	</array>
</dict>
</plist>
