<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of SimUText 2021-2022.</string>
	<key>Identifier</key>
	<string>com.github.vmiller.download.SimUText2021-2022</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SimUText 2021-2022</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>This recipe is deprecated and will be removed in the near future.</string>
			</dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
		</dict>		
		<dict>
			<key>Arguments</key>
			<dict>
				<key>appcast_url</key>
				<string>https://547264da4b8fdd572550-797074c1f5272f1615cb84698415a77a.ssl.cf1.rackcdn.com/simutext_2021-22_appcast.xml</string>
			</dict>
			<key>Processor</key>
			<string>SparkleUpdateInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/SimUText 2021-2022.app</string>
				<key>requirement</key>
				<string>certificate leaf = H"c27e037ed8a08aa8da241d6edd9e692ae6116da6"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
