<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Kurzweil 3000 Web client disk image</string>
    <key>Identifier</key>
    <string>com.github.vmiller.download.KurzweilWeb</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Kurzweil</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.kurzweiledu.com/k3mac</string>
                <key>re_pattern</key>
                <string>installv[0-9]{2}_mac_wl</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.kurzweiledu.com/%match%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>