<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Tracker and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.vmiller.munki.tracker</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Tracker</string>
        <key>NAME</key>
        <string>Tracker</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Tracker is a free video analysis and modeling tool built on the Open Source Physics (OSP) Java framework.</string>
            <key>category</key>
            <string>Physics</string>
            <key>developer</key>
            <string>Open Source Physics</string>
            <key>display_name</key>
            <string>Tracker</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>requires</key>
            <array>
                <string>Java6ForOSX</string>
            </array>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.vmiller.download.tracker</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <true/>
            </dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>dmg_root</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>DmgCreator</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>pkginfo</key>
                <dict>
                    <key>postinstall_script</key>
                    <string>#!/bin/sh
                    "/Applications/Tracker-%CURRENT_VERSION%-osx-installer.app/Contents/MacOS/osx-intel" --mode unattended
                    rc=$?
                    /bin/rm -r "/Applications/Tracker-%CURRENT_VERSION%-osx-installer.app"
                    exit $rc
                    </string>
                    <key>uninstall_script</key>
                    <string>#!/bin/sh
                    "/usr/local/tracker/uninstall_Tracker.app/Contents/MacOS/osx-intel" --mode unattended
                    </string>
                    <key>uninstall_method</key>
                    <string>uninstall_script</string>
                    <key>uninstallable</key>
                    <true/>
                    <key>unattended_install</key>
                    <true/>
                    <key>installs</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>/Applications/Tracker.app/Contents/Resources/Java/tracker-%CURRENT_VERSION%.jar</string>
                            <key>type</key>
                            <string>file</string>
                        </dict>
                    </array>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>