<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Tracker ZIP file. NOTE: https download/code signing not available for this software. Take care to inspect/test the downloaded file.</string>
	<key>Identifier</key>
	<string>com.github.vmiller.download.tracker</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Tracker</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>file=Tracker-([0-9\.]+)-osx-installer.zip</string>
				<key>result_output_var_name</key>
				<string>CURRENT_VERSION</string>
				<key>url</key>
				<string>http://physlets.org/tracker/</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.zip</string>
				<key>url</key>
				<string>http://physlets.org/tracker/installers/download.php?file=Tracker-%CURRENT_VERSION%-osx-installer.zip</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
	</array>
</dict>
</plist>
