<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of NetLogo</string>
    <key>Identifier</key>
    <string>com.github.vmiller.download.netlogo</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>NetLogo</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://ccl.northwestern.edu/netlogo/download.shtml</string>
                <key>re_pattern</key>
                <string>(?&lt;=NetLogo )([0-9\.]+)</string>
                <key>result_output_var_name</key>
                <string>CURRENT_VERSION</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://ccl.northwestern.edu/netlogo/%CURRENT_VERSION%/NetLogo%20%CURRENT_VERSION%.dmg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>