<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Recipe description</string>
	<key>Identifier</key>
	<string>com.github.vmiller.munki.VectorworksFullInstaller</string>
	<key>Input</key>
	<dict>
		<key>LDF_PATH</key>
		<string>%RECIPE_DIR%/xx-xxxxxx.ldf</string>
		<key>LDF_FILE_NAME</key>
		<string>xx-xxxxxx.ldf</string>
		<key>GROUP_ID</key>
		<string>80</string>	
		<key>NAME</key>
		<string>Vectorworks</string>
		<key>USER_ID</key>
		<string>0</string>
		<key>VW_SERIAL_NO</key>
		<string>GFXXXX-123456-ABCDEF-G7HI89</string>
		<key>repo_subdirectory</key>
		<string>apps/%NAME%</string>
		<key>pkginfo</key>
		<dict>
			<key>category</key>
			<string>Design</string>
			<key>developer</key>
			<string>Nemetschek</string>
			<key>description</key>
			<string>One flexible 3D design software for your entire process.

Sketch, model, present. The ultimate 3D software that handles projects from start to finish.</string>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>minimum_os_version</key>
			<string>12.0</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>uninstall_method</key>
			<string>uninstall_script</string>
			<key>uninstall_script</key>
			<string>#!/bin/bash
			/bin/rm -rf "/Applications/Vectorworks %MAJOR_VERSION%"</string>
			<key>unattended_install</key>
			<false/>
			<key>unattended_uninstall</key>
			<false/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.4</string>
	<key>ParentRecipe</key>
	<string>com.github.vmiller.download.vectorworksfullinstaller</string>	
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/Unarchived/Vectorworks %MAJOR_VERSION% Install Manager.app/Contents/Info.plist</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
    		<key>Processor</key>
    		<string>com.github.homebysix.VersionSplitter/VersionSplitter</string>
    		<key>Arguments</key>
    		<dict>
        		<key>split_on</key>
        		<string>.</string>
    		</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/Vectorworks</string>
				<key>pkgdirs</key>
				<dict>
					<key>vectorworks_install</key>
					<string>0755</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/Unarchived/Vectorworks %MAJOR_VERSION% Install Manager.app</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Vectorworks/vectorworks_install/Vectorworks %MAJOR_VERSION% Install Manager.app</string>
			</dict>
		</dict>		
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/Update/%MAJOR_VERSION%/%update_name%.vwim</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Vectorworks/vectorworks_install</string>
			</dict>
		</dict>	
		<dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%LDF_PATH%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/Vectorworks/vectorworks_install</string>
			</dict>
		</dict>		
		<dict>
			<key>Processor</key>
			<string>DmgCreator</string>			
			<key>Arguments</key>
			<dict>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/Vectorworks</string>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
			</dict>
		</dict>					
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>installs</key>
					<array>
						<dict>
							<key>CFBundleIdentifier</key>
							<string>net.nemetschek.vectorworks</string>
							<key>CFBundleName</key>
							<string>Vectorworks</string>
							<key>CFBundleVersion</key>
							<string>%version%.%update_version%</string>
							<key>path</key>
							<string>/Applications/Vectorworks %MAJOR_VERSION%/Vectorworks %MAJOR_VERSION%.app</string>
							<key>type</key>
							<string>application</string>
							<key>version_comparison_key</key>
							<string>CFBundleVersion</string>
						</dict>
					</array>
					<key>postinstall_script</key>
					<string>#!/bin/bash -x
						"/private/var/tmp/vw/vectorworks_install/Vectorworks %MAJOR_VERSION% Install Manager.app/Contents/Resources/cli.sh" install --installdir "/Applications/Vectorworks %MAJOR_VERSION%" --ldf /private/var/tmp/vw/vectorworks_install/%LDF_FILE_NAME% --serial %VW_SERIAL_NO% --uid %USER_ID% --gid %GROUP_ID% -i "/private/var/tmp/vw/vectorworks_install/%update_name%.wvim"</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>additional_makepkginfo_options</key>
				<array>
					<string>--itemname</string>
					<string>vectorworks_install</string>
					<string>--destinationpath</string>
					<string>/private/var/tmp/vw</string>
					<string>--pkgvers</string>
					<string>%version%.%update_version%</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
