<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>ownloads the new (as of 2026 release) Vectorworks installer package.  A properly formatted and named plist file must be in a directory specified in the vw_file input variable.  A dmg will be built with the package and the plist file at the root of the dmg.  The resulting disk image is imported into Munki.</string>
	<key>Identifier</key>
	<string>com.github.vmiller.munki.VectorworksPkg</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Vectorworks</string>
		<key>VW_FILES</key>
		<string>%RECIPE_DIR%/vw_files</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Design</string>
			<key>description</key>
			<string>One flexible 3D design software for your entire process.

Sketch, model, present. The ultimate 3D software that handles projects from start to finish.</string>
			<key>developer</key>
			<string>Nemetschek</string>
			<key>minimum_os_version</key>
			<string>12.0</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<false/>
			<key>unattended_uninstall</key>
			<false/>
			<key>uninstall_method</key>
			<string>uninstall_script</string>
			<key>uninstall_script</key>
			<string>#!/bin/bash
			/bin/rm -rf "/Applications/Vectorworks %RELEASE_VERSION%"</string>
		</dict>
		<key>repo_subdirectory</key>
		<string>apps/%NAME%</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.vmiller.download.VectorworksPkg</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>source_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>source_path</key>
				<string>%VW_FILES%/vw%RELEASE_VERSION%.plist</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%_%RELEASE_VERSION%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>installs</key>
					<array>
						<dict>
							<key>CFBundleIdentifier</key>
							<string>net.nemetschek.vectorworks</string>
							<key>CFBundleName</key>
							<string>Vectorworks</string>
							<key>CFBundleVersion</key>
							<string>%version%</string>
							<key>path</key>
							<string>/Applications/Vectorworks %RELEASE_VERSION%/Vectorworks %RELEASE_VERSION%.app</string>
							<key>type</key>
							<string>application</string>
							<key>version_comparison_key</key>
							<string>CFBundleVersion</string>
						</dict>
					</array>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_makepkginfo_options</key>
				<array>
					<string>--pkgvers</string>
					<string>%version%</string>
				</array>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%repo_subdirectory%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
